In [1]:
import pandas as pd

### Example
Reading data into dataframes

In [2]:
df = pd.read_csv('Buffet_Details.csv')

In [3]:
df

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
5   A6      Saju   31    Indian        12.56
6   A7    Monica   48   Chinese        11.09
7   A8    Preeti   67  American        12.23
8   A9      Emma   24    Indian        18.88
9  A10    Gaurav   29   Chinese        14.43

In [4]:
df.shape

(10, 5)

In [5]:
df.size

50

In [6]:
df.columns

Index(['Room', 'Name', 'Age', 'Cuisine', 'Expenditure'], dtype='object')

In [7]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [12]:
df.head()

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32

In [15]:
df.tail(3)

  Room    Name  Age   Cuisine  Expenditure
7   A8  Preeti   67  American        12.23
8   A9    Emma   24    Indian        18.88
9  A10  Gaurav   29   Chinese        14.43

In [16]:
df = pd.read_csv('Buffet_Details.csv',index_col="Room")

In [17]:
df

          Name  Age   Cuisine  Expenditure
Room
A1      Shilpa   18    Indian        24.65
A2    Jaspreet   32  American        18.54
A3     Dominic   19    Indian        27.66
A4       Ahmad   22  American        19.54
A5      Joseph   28    Indian        17.32
A6        Saju   31    Indian        12.56
A7      Monica   48   Chinese        11.09
A8      Preeti   67  American        12.23
A9        Emma   24    Indian        18.88
A10     Gaurav   29   Chinese        14.43

In [18]:
df.index

Index(['A1', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7', 'A8', 'A9', 'A10'], dtype='object', name='Room')

### Quiz
Load the file `carprices.csv` into a dataframe `df_cars` and study it. Use car_ID as index column.

In [19]:
df_cars = pd.read_csv('carprices.csv',index_col="car_ID")
df_cars

,symboling,carname,doornumber,carbody,enginelocation,wheelbase,carlength,carwidth,carheight,curbweight,cylindernumber,enginesize,boreratio,stroke,compressionratio,horsepower,peakrpm,citympg,highwaympg,price
car_ID,,,,,,,,,,,,,,,,,,,,
1,3,alfa-romero giulia,two,convertible,front,88.6,168.8,64.1,48.8,2548,four,130,3.47,2.68,9.0,111,5000,21,27,13495.0
2,3,alfa-romero stelvio,two,convertible,front,88.6,168.8,64.1,48.8,2548,four,130,3.47,2.68,9.0,111,5000,21,27,16500.0
3,1,alfa-romero Quadrifoglio,two,hatchback,front,94.5,171.2,65.5,52.4,2823,six,152,2.68,3.47,9.0,154,5000,19,26,16500.0
4,2,audi 100 ls,four,sedan,front,99.8,176.6,66.2,54.3,2337,four,109,3.19,3.40,10.0,102,5500,24,30,13950.0
5,2,audi 100ls,four,sedan,front,99.4,176.6,66.4,54.3,2824,five,136,3.19,3.40,8.0,115,5500,18,22,17450.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
201,-1,volvo 145e (sw),four,sedan,front,109.1,188.8,68.9,55.5,2952,four,141,3.78,3.15,9.5,114,5400,23,28,16845.0
202,-1,volvo 144ea,four,sedan,front,109.1,188.8,68.8,55.5,3049,four,141,3.78,3.15,8.7,160,5300,19,25,19045.0
203,-1,volvo 244dl,four,sedan,front,109.1,188.8,68.9,55.5,3012,six,173,3.58,2.87,8.8,134,5500,18,23,21485.0
204,-1,volvo 246,four,sedan,front,109.1,188.8,68.9,55.5,3217,six,145,3.01,3.40,23.0,106,4800,26,27,22470.0
205,-1,volvo 264gl,four,sedan,front,109.1,188.8,68.9,55.5,3062,four,141,3.78,3.15,9.5,114,5400,19,25,22625.0

In [20]:
df_cars.shape
# no. of rows, no. of columns

(205, 20)

In [21]:
df_cars.size
# no. of elements

4100

In [22]:
df_cars.columns

Index(['symboling', 'carname', 'doornumber', 'carbody', 'enginelocation',
       'wheelbase', 'carlength', 'carwidth', 'carheight', 'curbweight',
       'cylindernumber', 'enginesize', 'boreratio', 'stroke',
       'compressionratio', 'horsepower', 'peakrpm', 'citympg', 'highwaympg',
       'price'],
      dtype='object')

In [23]:
df_cars.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            196, 197, 198, 199, 200, 201, 202, 203, 204, 205],
           dtype='int64', name='car_ID', length=205)

In [24]:
df_cars.head()
# by default top 5 rows of the df

,symboling,carname,doornumber,carbody,enginelocation,wheelbase,carlength,carwidth,carheight,curbweight,cylindernumber,enginesize,boreratio,stroke,compressionratio,horsepower,peakrpm,citympg,highwaympg,price
car_ID,,,,,,,,,,,,,,,,,,,,
1,3,alfa-romero giulia,two,convertible,front,88.6,168.8,64.1,48.8,2548,four,130,3.47,2.68,9.0,111,5000,21,27,13495.0
2,3,alfa-romero stelvio,two,convertible,front,88.6,168.8,64.1,48.8,2548,four,130,3.47,2.68,9.0,111,5000,21,27,16500.0
3,1,alfa-romero Quadrifoglio,two,hatchback,front,94.5,171.2,65.5,52.4,2823,six,152,2.68,3.47,9.0,154,5000,19,26,16500.0
4,2,audi 100 ls,four,sedan,front,99.8,176.6,66.2,54.3,2337,four,109,3.19,3.40,10.0,102,5500,24,30,13950.0
5,2,audi 100ls,four,sedan,front,99.4,176.6,66.4,54.3,2824,five,136,3.19,3.40,8.0,115,5500,18,22,17450.0

In [25]:
df_cars.head(3)

,symboling,carname,doornumber,carbody,enginelocation,wheelbase,carlength,carwidth,carheight,curbweight,cylindernumber,enginesize,boreratio,stroke,compressionratio,horsepower,peakrpm,citympg,highwaympg,price
car_ID,,,,,,,,,,,,,,,,,,,,
1,3,alfa-romero giulia,two,convertible,front,88.6,168.8,64.1,48.8,2548,four,130,3.47,2.68,9.0,111,5000,21,27,13495.0
2,3,alfa-romero stelvio,two,convertible,front,88.6,168.8,64.1,48.8,2548,four,130,3.47,2.68,9.0,111,5000,21,27,16500.0
3,1,alfa-romero Quadrifoglio,two,hatchback,front,94.5,171.2,65.5,52.4,2823,six,152,2.68,3.47,9.0,154,5000,19,26,16500.0

In [26]:
df_cars.tail()
# by default last 5 rows of the df

,symboling,carname,doornumber,carbody,enginelocation,wheelbase,carlength,carwidth,carheight,curbweight,cylindernumber,enginesize,boreratio,stroke,compressionratio,horsepower,peakrpm,citympg,highwaympg,price
car_ID,,,,,,,,,,,,,,,,,,,,
201,-1,volvo 145e (sw),four,sedan,front,109.1,188.8,68.9,55.5,2952,four,141,3.78,3.15,9.5,114,5400,23,28,16845.0
202,-1,volvo 144ea,four,sedan,front,109.1,188.8,68.8,55.5,3049,four,141,3.78,3.15,8.7,160,5300,19,25,19045.0
203,-1,volvo 244dl,four,sedan,front,109.1,188.8,68.9,55.5,3012,six,173,3.58,2.87,8.8,134,5500,18,23,21485.0
204,-1,volvo 246,four,sedan,front,109.1,188.8,68.9,55.5,3217,six,145,3.01,3.40,23.0,106,4800,26,27,22470.0
205,-1,volvo 264gl,four,sedan,front,109.1,188.8,68.9,55.5,3062,four,141,3.78,3.15,9.5,114,5400,19,25,22625.0

In [27]:
df_cars.tail(2)

,symboling,carname,doornumber,carbody,enginelocation,wheelbase,carlength,carwidth,carheight,curbweight,cylindernumber,enginesize,boreratio,stroke,compressionratio,horsepower,peakrpm,citympg,highwaympg,price
car_ID,,,,,,,,,,,,,,,,,,,,
204,-1,volvo 246,four,sedan,front,109.1,188.8,68.9,55.5,3217,six,145,3.01,3.40,23.0,106,4800,26,27,22470.0
205,-1,volvo 264gl,four,sedan,front,109.1,188.8,68.9,55.5,3062,four,141,3.78,3.15,9.5,114,5400,19,25,22625.0

### Quiz
Study the data types of the features in the `df_cars` dataframe

In [28]:
df_cars.dtypes

symboling             int64
carname              object
doornumber           object
carbody              object
enginelocation       object
wheelbase           float64
carlength           float64
carwidth            float64
carheight           float64
curbweight            int64
cylindernumber       object
enginesize            int64
boreratio           float64
stroke              float64
compressionratio    float64
horsepower            int64
peakrpm               int64
citympg               int64
highwaympg            int64
price               float64
dtype: object

In [29]:
# object is same as string

In [30]:
df_cars.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 205 entries, 1 to 205
Data columns (total 20 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   symboling         205 non-null    int64
 1   carname           205 non-null    object
 2   doornumber        205 non-null    object
 3   carbody           205 non-null    object
 4   enginelocation    205 non-null    object
 5   wheelbase         205 non-null    float64
 6   carlength         205 non-null    float64
 7   carwidth          205 non-null    float64
 8   carheight         205 non-null    float64
 9   curbweight        205 non-null    int64
 10  cylindernumber    205 non-null    object
 11  enginesize        205 non-null    int64
 12  boreratio         205 non-null    float64
 13  stroke            205 non-null    float64
 14  compressionratio  205 non-null    float64
 15  horsepower        205 non-null    int64
 16  peakrpm           205 non-null    int64
 17  citympg           205 non-null    int64
 18  highwaympg        205 non-null    int64
 19  price             205 non-null    float64
dtypes: float64(8), int64(7), object(5)
memory usage: 33.6+ KB

In [31]:
## Indexing

In [33]:
df_cars["carname"]

car_ID
1            alfa-romero giulia
2           alfa-romero stelvio
3      alfa-romero Quadrifoglio
4                   audi 100 ls
5                    audi 100ls
                 ...
201             volvo 145e (sw)
202                 volvo 144ea
203                 volvo 244dl
204                   volvo 246
205                 volvo 264gl
Name: carname, Length: 205, dtype: object

In [34]:
df_cars[["carname","carbody","price"]]

                         carname      carbody    price
car_ID
1             alfa-romero giulia  convertible  13495.0
2            alfa-romero stelvio  convertible  16500.0
3       alfa-romero Quadrifoglio    hatchback  16500.0
4                    audi 100 ls        sedan  13950.0
5                     audi 100ls        sedan  17450.0
...                          ...          ...      ...
201              volvo 145e (sw)        sedan  16845.0
202                  volvo 144ea        sedan  19045.0
203                  volvo 244dl        sedan  21485.0
204                    volvo 246        sedan  22470.0
205                  volvo 264gl        sedan  22625.0

[205 rows x 3 columns]

# Accessing data from dataframes - II
In this section, we will study various access methods to access data from dataframes. We will focus more on the fundamentals in this session and briefly look at some other important methods. Note that you will work with these operations and methods throughout your data science learning journey and beyond.

For this part, we will continue studying access methods for dataframes

In [35]:
df = pd.read_csv('Buffet_Details.csv')
tempdf = pd.read_csv('Buffet_Details.csv', index_col = 'Room')
df_cars = pd.read_csv('carprices.csv')
df_movies = pd.read_csv('User_Movie_Ratings.csv', index_col = 'User')

### Example
The `iloc` and `loc` indexer

In [36]:
tempdf

          Name  Age   Cuisine  Expenditure
Room
A1      Shilpa   18    Indian        24.65
A2    Jaspreet   32  American        18.54
A3     Dominic   19    Indian        27.66
A4       Ahmad   22  American        19.54
A5      Joseph   28    Indian        17.32
A6        Saju   31    Indian        12.56
A7      Monica   48   Chinese        11.09
A8      Preeti   67  American        12.23
A9        Emma   24    Indian        18.88
A10     Gaurav   29   Chinese        14.43

In [37]:
tempdf.iloc[0]
# Position Based Index

Name           Shilpa
Age                18
Cuisine        Indian
Expenditure     24.65
Name: A1, dtype: object

In [39]:
tempdf.loc["A1"]
# Row Index

Name           Shilpa
Age                18
Cuisine        Indian
Expenditure     24.65
Name: A1, dtype: object

### Example
Accessing data conditionally, also called Boolean indexing

In [40]:
df

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
5   A6      Saju   31    Indian        12.56
6   A7    Monica   48   Chinese        11.09
7   A8    Preeti   67  American        12.23
8   A9      Emma   24    Indian        18.88
9  A10    Gaurav   29   Chinese        14.43

In [41]:
df[df["Expenditure"]>15]

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
8   A9      Emma   24    Indian        18.88

In [42]:
df[df["Cuisine"]=="Indian"]

  Room     Name  Age Cuisine  Expenditure
0   A1   Shilpa   18  Indian        24.65
2   A3  Dominic   19  Indian        27.66
4   A5   Joseph   28  Indian        17.32
5   A6     Saju   31  Indian        12.56
8   A9     Emma   24  Indian        18.88

In [43]:
df[(df["Expenditure"]>15) & (df["Cuisine"]=="Indian")]

  Room     Name  Age Cuisine  Expenditure
0   A1   Shilpa   18  Indian        24.65
2   A3  Dominic   19  Indian        27.66
4   A5   Joseph   28  Indian        17.32
8   A9     Emma   24  Indian        18.88

In [44]:
df[(df["Expenditure"]>15) | (df["Cuisine"]=="Indian")]

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
5   A6      Saju   31    Indian        12.56
8   A9      Emma   24    Indian        18.88

In [45]:
df[df['Cuisine'].isin(['Indian', 'Chinese'])]

  Room     Name  Age  Cuisine  Expenditure
0   A1   Shilpa   18   Indian        24.65
2   A3  Dominic   19   Indian        27.66
4   A5   Joseph   28   Indian        17.32
5   A6     Saju   31   Indian        12.56
6   A7   Monica   48  Chinese        11.09
8   A9     Emma   24   Indian        18.88
9  A10   Gaurav   29  Chinese        14.43

In [46]:
df[(df["Cuisine"]=="Chinese") | (df["Cuisine"]=="Indian")]

  Room     Name  Age  Cuisine  Expenditure
0   A1   Shilpa   18   Indian        24.65
2   A3  Dominic   19   Indian        27.66
4   A5   Joseph   28   Indian        17.32
5   A6     Saju   31   Indian        12.56
6   A7   Monica   48  Chinese        11.09
8   A9     Emma   24   Indian        18.88
9  A10   Gaurav   29  Chinese        14.43

### Quiz
How many cars in the `df_cars` dataframe are sedans?

In [49]:
df_cars[df_cars['carbody']=='sedan'].shape[0]

96

In [50]:
len(df_cars[df_cars['carbody']=='sedan'])

96

### Quiz
How many users in the `df_movies` dataframe rated more than 7 for Thor and Spiderman but rated 7 or less for Dolittle?

In [51]:
len(df_movies[(df_movies["Thor"]>7) & (df_movies["Spiderman"]>7) & (df_movies["Dolittle"]<=7)])

6

### Quiz
How many cars in the `df_cars` dataframe are convertibles with a city mileage more than 20 and price less than 15000?

In [52]:
len(df_cars[(df_cars['carbody'] == 'convertible') & (df_cars['citympg'] > 20) & (df_cars['price'] < 15000)])

2

### Example
Arithmetic and inter-column operations

In [53]:
df

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
5   A6      Saju   31    Indian        12.56
6   A7    Monica   48   Chinese        11.09
7   A8    Preeti   67  American        12.23
8   A9      Emma   24    Indian        18.88
9  A10    Gaurav   29   Chinese        14.43

In [54]:
df['Expenditure'] + 10

0    34.65
1    28.54
2    37.66
3    29.54
4    27.32
5    22.56
6    21.09
7    22.23
8    28.88
9    24.43
Name: Expenditure, dtype: float64

In [55]:
df['Expenditure'].add(10)

0    34.65
1    28.54
2    37.66
3    29.54
4    27.32
5    22.56
6    21.09
7    22.23
8    28.88
9    24.43
Name: Expenditure, dtype: float64

In [56]:
df['Expenditure'] - 5

0    19.65
1    13.54
2    22.66
3    14.54
4    12.32
5     7.56
6     6.09
7     7.23
8    13.88
9     9.43
Name: Expenditure, dtype: float64

In [57]:
df['Expenditure'].sub(5)

0    19.65
1    13.54
2    22.66
3    14.54
4    12.32
5     7.56
6     6.09
7     7.23
8    13.88
9     9.43
Name: Expenditure, dtype: float64

In [58]:
df['Expenditure']*2

0    49.30
1    37.08
2    55.32
3    39.08
4    34.64
5    25.12
6    22.18
7    24.46
8    37.76
9    28.86
Name: Expenditure, dtype: float64

In [59]:
df['Expenditure'].mul(2)

0    49.30
1    37.08
2    55.32
3    39.08
4    34.64
5    25.12
6    22.18
7    24.46
8    37.76
9    28.86
Name: Expenditure, dtype: float64

In [60]:
df['Expenditure']/2

0    12.325
1     9.270
2    13.830
3     9.770
4     8.660
5     6.280
6     5.545
7     6.115
8     9.440
9     7.215
Name: Expenditure, dtype: float64

In [61]:
df['Expenditure'].div(2)

0    12.325
1     9.270
2    13.830
3     9.770
4     8.660
5     6.280
6     5.545
7     6.115
8     9.440
9     7.215
Name: Expenditure, dtype: float64

In [64]:
df["Expenditure"].round(1)

0    24.6
1    18.5
2    27.7
3    19.5
4    17.3
5    12.6
6    11.1
7    12.2
8    18.9
9    14.4
Name: Expenditure, dtype: float64

### Example
Statistical operations

In [65]:
df

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
5   A6      Saju   31    Indian        12.56
6   A7    Monica   48   Chinese        11.09
7   A8    Preeti   67  American        12.23
8   A9      Emma   24    Indian        18.88
9  A10    Gaurav   29   Chinese        14.43

In [66]:
df['Age'].sum()

318

In [67]:
df['Age'].mean()

31.8

In [68]:
df['Expenditure'].mean()

17.689999999999998

In [69]:
df['Age'].max()

67

In [70]:
df['Expenditure'].min()

11.09

In [71]:
df['Age'].idxmin()

0

In [72]:
df['Expenditure'].idxmax()

2

In [73]:
df['Expenditure'].median()

17.93

In [74]:
df['Cuisine'].unique()
# unique values

array(['Indian', 'American', 'Chinese'], dtype=object)

In [75]:
df['Cuisine'].nunique()
# number of unique values

3

In [76]:
df['Cuisine'].value_counts()
# count of each unique value

Indian      5
American    3
Chinese     2
Name: Cuisine, dtype: int64

In [77]:
df['Cuisine'].count()

10

### Example
Sorting operations

In [78]:
df

  Room      Name  Age   Cuisine  Expenditure
0   A1    Shilpa   18    Indian        24.65
1   A2  Jaspreet   32  American        18.54
2   A3   Dominic   19    Indian        27.66
3   A4     Ahmad   22  American        19.54
4   A5    Joseph   28    Indian        17.32
5   A6      Saju   31    Indian        12.56
6   A7    Monica   48   Chinese        11.09
7   A8    Preeti   67  American        12.23
8   A9      Emma   24    Indian        18.88
9  A10    Gaurav   29   Chinese        14.43

In [79]:
df.sort_values(by = 'Expenditure')
# ascending order - by default

  Room      Name  Age   Cuisine  Expenditure
6   A7    Monica   48   Chinese        11.09
7   A8    Preeti   67  American        12.23
5   A6      Saju   31    Indian        12.56
9  A10    Gaurav   29   Chinese        14.43
4   A5    Joseph   28    Indian        17.32
1   A2  Jaspreet   32  American        18.54
8   A9      Emma   24    Indian        18.88
3   A4     Ahmad   22  American        19.54
0   A1    Shilpa   18    Indian        24.65
2   A3   Dominic   19    Indian        27.66

In [80]:
df.sort_values(by = 'Expenditure', ascending = False)
# descending order

  Room      Name  Age   Cuisine  Expenditure
2   A3   Dominic   19    Indian        27.66
0   A1    Shilpa   18    Indian        24.65
3   A4     Ahmad   22  American        19.54
8   A9      Emma   24    Indian        18.88
1   A2  Jaspreet   32  American        18.54
4   A5    Joseph   28    Indian        17.32
9  A10    Gaurav   29   Chinese        14.43
5   A6      Saju   31    Indian        12.56
7   A8    Preeti   67  American        12.23
6   A7    Monica   48   Chinese        11.09

### Example
Group operations

In [81]:
df.groupby("Cuisine")["Expenditure"].mean()

Cuisine
American    16.770
Chinese     12.760
Indian      20.214
Name: Expenditure, dtype: float64

In [84]:
print(df[df["Cuisine"]=="American"]["Expenditure"].mean())
print(df[df["Cuisine"]=="Chinese"]["Expenditure"].mean())
print(df[df["Cuisine"]=="Indian"]["Expenditure"].mean())

16.77
12.76
20.214

In [85]:
print(df[df["Cuisine"]=="American"]["Expenditure"].max())
print(df[df["Cuisine"]=="Chinese"]["Expenditure"].max())
print(df[df["Cuisine"]=="Indian"]["Expenditure"].max())

19.54
14.43
27.66

In [86]:
df.groupby("Cuisine")["Expenditure"].max()

Cuisine
American    19.54
Chinese     14.43
Indian      27.66
Name: Expenditure, dtype: float64

In [87]:
df.groupby("Cuisine")["Expenditure"].min()

Cuisine
American    12.23
Chinese     11.09
Indian      12.56
Name: Expenditure, dtype: float64

In [ ]:
#max/min/sum/median/count/mean etc etc